# Sascha's Brewfile - Stateless Workstation
# Install: brew bundle install --file=Brewfile

# Taps
tap "koekeishiya/formulae"
tap "supabase/tap"
tap "ddev/ddev"

# ===========================================
# CORE TOOLS
# ===========================================

# Editors
brew "neovim"
brew "vim"

# Terminal
brew "tmux"
brew "tmuxinator"
brew "fish"

# Git
brew "git"
brew "lazygit"
brew "hub"
brew "tig"

# ===========================================
# KUBERNETES & DEVOPS
# ===========================================
brew "kubernetes-cli"
brew "k9s"
# brew "helm"  # uncomment if needed

# ===========================================
# DEVELOPMENT
# ===========================================

# Node.js
brew "node@20"
brew "yarn"

# Python
brew "python@3.12"
brew "pipx"

# PHP
brew "php"
brew "composer"

# Mobile Dev
brew "cocoapods"
brew "fastlane"
brew "ios-deploy"
brew "watchman"

# ===========================================
# CLI UTILITIES
# ===========================================
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "zoxide"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "ctags"
brew "peco"
brew "gnu-sed"
brew "jq"  # JSON processor

# ===========================================
# MISC
# ===========================================
brew "imagemagick"
brew "hugo"
brew "pandoc"
brew "mkcert"
brew "nmap"
brew "midnight-commander"

# Window Manager (optional)
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# Supabase CLI
brew "supabase/tap/supabase"

# DDEV for local WordPress/PHP
brew "ddev/ddev/ddev"

# ===========================================
# CASKS (GUI Apps)
# ===========================================
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "forklift"

# Java for Android Dev
cask "zulu@17"
